


MMUSIC Working Group                                         C. Holmberg
Internet-Draft                                                  Ericsson
Updates: 3264 (if approved)                                H. Alvestrand
Intended status: Standards Track                                  Google
Expires: December 21, 2016                                   C. Jennings
                                                                   Cisco
                                                           June 19, 2016


 Negotiating Media Multiplexing Using the Session Description Protocol
                                 (SDP)
            draft-ietf-mmusic-sdp-bundle-negotiation-31.txt

Abstract

   This specification defines a new Session Description Protocol (SDP)
   Grouping Framework extension, 'BUNDLE'.  The extension can be used
   with the SDP Offer/Answer mechanism to negotiate the usage of a
   single address:port combination (BUNDLE address) for receiving media,
   referred to as bundled media, specified by multiple SDP media
   descriptions ("m=" lines).

   To assist endpoints in negotiating the use of bundle this
   specification defines a new SDP attribute, 'bundle-only', which can
   be used to request that specific media is only used if bundled.  The
   specification also updates RFC 3264, to allow usage of zero port
   values without meaning that media is rejcted.

   There are multiple ways to correlate the bundled RTP packets with the
   appropriate media descriptions.  This specification defines a new
   Real-time Transport Protocol (RTP) source description (SDES) item and
   a new RTP header extension that provides an additional way to do this
   correlation by using them to carry a value that associates the RTP/
   RTCP packets with a specific media description.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any




Holmberg, et al.        Expires December 21, 2016               [Page 1]

Internet-Draft                Bundled media                    June 2016


   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on December 21, 2016.

Copyright Notice

   Copyright (c) 2016 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

   This document may contain material from IETF Documents or IETF
   Contributions published or made publicly available before November
   10, 2008.  The person(s) controlling the copyright in some of this
   material may not have granted the IETF Trust the right to allow
   modifications of such material outside the IETF Standards Process.
   Without obtaining an adequate license from the person(s) controlling
   the copyright in such materials, this document may not be modified
   outside the IETF Standards Process, and derivative works of it may
   not be created outside the IETF Standards Process, except to format
   it for publication as an RFC or to translate it into languages other
   than English.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   4
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   6
   3.  Conventions . . . . . . . . . . . . . . . . . . . . . . . . .   7
   4.  Applicability Statement . . . . . . . . . . . . . . . . . . .   7
   5.  SDP Grouping Framework BUNDLE Extension . . . . . . . . . . .   7
   6.  SDP 'bundle-only' Attribute . . . . . . . . . . . . . . . . .   8
   7.  SDP Information Considerations  . . . . . . . . . . . . . . .   9
     7.1.  General . . . . . . . . . . . . . . . . . . . . . . . . .   9
     7.2.  Connection Data (c=)  . . . . . . . . . . . . . . . . . .   9
     7.3.  Bandwidth (b=)  . . . . . . . . . . . . . . . . . . . . .   9
     7.4.  Attributes (a=) . . . . . . . . . . . . . . . . . . . . .   9
   8.  SDP Offer/Answer Procedures . . . . . . . . . . . . . . . . .   9
     8.1.  General . . . . . . . . . . . . . . . . . . . . . . . . .   9
     8.2.  Mux Category Considerations . . . . . . . . . . . . . . .  10



Holmberg, et al.        Expires December 21, 2016               [Page 2]

Internet-Draft                Bundled media                    June 2016


     8.3.  Generating the Initial SDP Offer  . . . . . . . . . . . .  10
       8.3.1.  General . . . . . . . . . . . . . . . . . . . . . . .  11
       8.3.2.  Suggesting the offerer BUNDLE address . . . . . . . .  11
     8.4.  Generating the SDP Answer . . . . . . . . . . . . . . . .  11
       8.4.1.  General . . . . . . . . . . . . . . . . . . . . . . .  12
       8.4.2.  Answerer Selection of Offerer Bundle Address  . . . .  13
       8.4.3.  Answerer Selection of Answerer BUNDLE Address . . . .  13
       8.4.4.  Moving A Media Description Out Of A BUNDLE Group  . .  14
       8.4.5.  Rejecting A Media Description In A BUNDLE Group . . .  14
     8.5.  Offerer Processing of the SDP Answer  . . . . . . . . . .  14
     8.6.  Modifying the Session . . . . . . . . . . . . . . . . . .  15
       8.6.1.  General . . . . . . . . . . . . . . . . . . . . . . .  15
       8.6.2.  Suggesting a new offerer BUNDLE address . . . . . . .  15
       8.6.3.  Adding a media description to a BUNDLE group  . . . .  16
       8.6.4.  Moving A Media Description Out Of A BUNDLE Group  . .  16
       8.6.5.  Disabling A Media Description In A BUNDLE Group . . .  17
   9.  Protocol Identification . . . . . . . . . . . . . . . . . . .  17
     9.1.  General . . . . . . . . . . . . . . . . . . . . . . . . .  17
     9.2.  STUN, DTLS, SRTP  . . . . . . . . . . . . . . . . . . . .  18
   10. RTP Considerations  . . . . . . . . . . . . . . . . . . . . .  18
     10.1.  Single RTP Session . . . . . . . . . . . . . . . . . . .  18
       10.1.1.  General  . . . . . . . . . . . . . . . . . . . . . .  18
       10.1.2.  Payload Type (PT) Value Reuse  . . . . . . . . . . .  19
     10.2.  Associating RTP/RTCP Packets With Correct SDP Media
            Description  . . . . . . . . . . . . . . . . . . . . . .  19
     10.3.  RTP/RTCP Multiplexing  . . . . . . . . . . . . . . . . .  20
       10.3.1.  General  . . . . . . . . . . . . . . . . . . . . . .  20
       10.3.2.  SDP Offer/Answer Procedures  . . . . . . . . . . . .  20
   11. ICE Considerations  . . . . . . . . . . . . . . . . . . . . .  22
     11.1.  General  . . . . . . . . . . . . . . . . . . . . . . . .  23
     11.2.  SDP Offer/Answer Procedures  . . . . . . . . . . . . . .  23
       11.2.1.  General  . . . . . . . . . . . . . . . . . . . . . .  23
       11.2.2.  Generating the Initial SDP Offer . . . . . . . . . .  24
       11.2.3.  Generating the SDP Answer  . . . . . . . . . . . . .  24
       11.2.4.  Offerer Processing of the SDP Answer . . . . . . . .  24
       11.2.5.  Modifying the Session  . . . . . . . . . . . . . . .  24
   12. DTLS Considerations . . . . . . . . . . . . . . . . . . . . .  25
   13. Update to RFC 3264  . . . . . . . . . . . . . . . . . . . . .  25
     13.1.  General  . . . . . . . . . . . . . . . . . . . . . . . .  25
     13.2.  Original text of section 5.1 (2nd paragraph) of RFC 3264  26
     13.3.  New text replacing section 5.1 (2nd paragraph) of RFC
            3264 . . . . . . . . . . . . . . . . . . . . . . . . . .  26
     13.4.  Original text of section 8.2 (2nd paragraph) of RFC 3264  26
     13.5.  New text replacing section 8.2 (2nd paragraph) of RFC
            3264 . . . . . . . . . . . . . . . . . . . . . . . . . .  26
     13.6.  Original text of section 8.4 (6th paragraph) of RFC 3264  27
     13.7.  New text replacing section 8.4 (6th paragraph) of RFC
            3264 . . . . . . . . . . . . . . . . . . . . . . . . . .  27



Holmberg, et al.        Expires December 21, 2016               [Page 3]

Internet-Draft                Bundled media                    June 2016


   14. RTP/RTCP extensions for identification-tag transport  . . . .  27
     14.1.  General  . . . . . . . . . . . . . . . . . . . . . . . .  27
     14.2.  RTCP MID SDES Item . . . . . . . . . . . . . . . . . . .  28
     14.3.  RTP MID Header Extension . . . . . . . . . . . . . . . .  29
   15. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  29
     15.1.  New SDES item  . . . . . . . . . . . . . . . . . . . . .  29
     15.2.  New RTP Header Extension URI . . . . . . . . . . . . . .  30
     15.3.  New SDP Attribute  . . . . . . . . . . . . . . . . . . .  30
     15.4.  New SDP Group Semantics  . . . . . . . . . . . . . . . .  31
   16. Security Considerations . . . . . . . . . . . . . . . . . . .  31
   17. Examples  . . . . . . . . . . . . . . . . . . . . . . . . . .  32
     17.1.  Example: Bundle Address Selection  . . . . . . . . . . .  32
     17.2.  Example: BUNDLE Extension Rejected . . . . . . . . . . .  34
     17.3.  Example: Offerer Adds A Media Description To A BUNDLE
            Group  . . . . . . . . . . . . . . . . . . . . . . . . .  35
     17.4.  Example: Offerer Moves A Media Description Out Of A
            BUNDLE Group . . . . . . . . . . . . . . . . . . . . . .  37
     17.5.  Example: Offerer Disables A Media Description Within A
            BUNDLE Group . . . . . . . . . . . . . . . . . . . . . .  38
   18. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  40
   19. Change Log  . . . . . . . . . . . . . . . . . . . . . . . . .  40
   20. References  . . . . . . . . . . . . . . . . . . . . . . . . .  47
     20.1.  Normative References . . . . . . . . . . . . . . . . . .  47
     20.2.  Informative References . . . . . . . . . . . . . . . . .  49
   Appendix A.  Design Considerations  . . . . . . . . . . . . . . .  50
     A.1.  General . . . . . . . . . . . . . . . . . . . . . . . . .  50
     A.2.  UA Interoperability . . . . . . . . . . . . . . . . . . .  50
     A.3.  Usage of port number value zero . . . . . . . . . . . . .  52
     A.4.  B2BUA And Proxy Interoperability  . . . . . . . . . . . .  52
       A.4.1.  Traffic Policing  . . . . . . . . . . . . . . . . . .  53
       A.4.2.  Bandwidth Allocation  . . . . . . . . . . . . . . . .  53
     A.5.  Candidate Gathering . . . . . . . . . . . . . . . . . . .  53
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  54

1.  Introduction

   This specification defines a way to use a single address:port
   combination (BUNDLE address) for receiving media specified by
   multiple SDP media descriptions ("m=" lines).

   This specification defines a new SDP Grouping Framework [RFC5888]
   extension called 'BUNDLE'.  The extension can be used with the
   Session Description Protocol (SDP) Offer/Answer mechanism [RFC3264]
   to negotiate the usage of a BUNDLE group.  Within the BUNDLE group, a
   BUNDLE address is used for receiving media specified by multiple "m="
   lines.  This is referred to as bundled media.





Holmberg, et al.        Expires December 21, 2016               [Page 4]

Internet-Draft                Bundled media                    June 2016


   The offerer and answerer [RFC3264] use the BUNDLE extension to
   negotiate the BUNDLE addresses, one for the offerer (offerer BUNDLE
   address) and one for the answerer (answerer BUNDLE address), to be
   used for receiving the bundled media specified by a BUNDLE group.
   Once the offerer and the answerer have negotiated a BUNDLE group,
   they associate their respective BUNDLE address with each "m=" line in
   the BUNDLE group.  The BUNDLE addresses are used to receive all media
   specified by the BUNDLE group.

   The use of a BUNDLE group and a BUNDLE address also allows the usage
   of a single set of Interactive Connectivity Establishment (ICE)
   [RFC5245] candidates for multiple "m=" lines.

   This specification also defines a new SDP attribute, 'bundle-only',
   which can be used to request that specific media is only used if kept
   within a BUNDLE group.  The specification also updates RFC 3264, to
   allow usage of zero port values without meaning that media is
   rejcted.

   As defined in RFC 4566 [RFC4566], the semantics of assigning the same
   port value to multiple "m=" lines are undefined, and there is no
   grouping defined by such means.  Instead, an explicit grouping
   mechanism needs to be used to express the intended semantics.  This
   specification provides such an extension.

   This specification also updates sections 5.1, 8.1 and 8.2 of RFC 3264
   [RFC3264].  The update allows an answerer to assign a non-zero port
   value to an "m=" line in an SDP answer, even if the "m=" line in the
   associated SDP offer contained a zero port value.

   This specification also defines a new Real-time Transport Protocol
   (RTP) [RFC3550] source description (SDES) item and a new RTP header
   extension that can be used to carry a value that associates RTP/RTCP
   packets with a specific media description.  This can be used to
   correlate a RTP packet with the correct media.

   SDP bodies can contain multiple BUNDLE groups.  A given BUNDLE
   address MUST only be associated with a single BUNDLE group.  The
   procedures in this specification apply independently to a given
   BUNDLE group.  All RTP based media flows described by a single BUNDLE
   group belong to a single RTP session [RFC3550].

   The BUNDLE extension is backward compatible.  Endpoints that do not
   support the extension are expected to generate offers and answers
   without an SDP 'group:BUNDLE' attribute, and are expected to
   associate a unique address with each "m=" line within an offer and
   answer, according to the procedures in [RFC4566] and [RFC3264]




Holmberg, et al.        Expires December 21, 2016               [Page 5]

Internet-Draft                Bundled media                    June 2016


2.  Terminology

   "m=" line: SDP bodies contain one or more media descriptions.  Each
   media description is identified by an SDP "m=" line.

   5-tuple: A collection of the following values: source address, source
   port, destination address, destination port, and transport-layer
   protocol.

   Unique address: An IP address and port combination that is associated
   with only one "m=" line in an offer or answer.

   Shared address: An IP address and port combination that is associated
   with multiple "m=" lines within an offer or answer.

   Offerer BUNDLE-tag: The first identification-tag in a given SDP
   'group:BUNDLE' attribute identification-tag list in an offer.

   Answerer BUNDLE-tag: The first identification-tag in a given SDP
   'group:BUNDLE' attribute identification-tag list in an answer.

   Offerer BUNDLE address: Within a given BUNDLE group, an IP address
   and port combination used by an offerer to receive all media
   specified by each "m=" line within the BUNDLE group.

   Answerer BUNDLE address: Within a given BUNDLE group, an IP address
   and port combination used by an answerer to receive all media
   specified by each "m=" line within the BUNDLE group.

   BUNDLE group: A set of "m=" lines, created using an SDP Offer/Answer
   exchange, which uses the same BUNDLE address for receiving media.

   Bundled "m=" line: An "m=" line, whose identification-tag is placed
   in an SDP 'group:BUNDLE' attribute identification-tag list in an
   offer or answer.

   Bundle-only "m=" line: A bundled "m=" line with an associated SDP
   'bundle-only' attribute.

   Bundled media: All media specified by a given BUNDLE group.

   Initial offer: The first offer, within an SDP session (e.g. a SIP
   dialog when the Session Initiation Protocol (SIP) [RFC3261] is used
   to carry SDP), in which the offerer indicates that it wants to create
   a given BUNDLE group.

   Subsequent offer: An offer which contains a BUNDLE group that has
   been created as part of a previous offer/answer exchange.



Holmberg, et al.        Expires December 21, 2016               [Page 6]

Internet-Draft                Bundled media                    June 2016


   Identification-tag: A unique token value that is used to identify an
   "m=" line.  The SDP 'mid' attribute [RFC5888], associated with an
   "m=" line, carries an unique identification-tag.  The session-level
   SDP 'group' attribute [RFC5888] carries a list of identification-
   tags, identifying the "m=" lines associated with that particular
   'group' attribute.

3.  Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in BCP 14, RFC 2119
   [RFC2119].

4.  Applicability Statement

   The mechanism in this specification only applies to the Session
   Description Protocol (SDP) [RFC4566], when used together with the SDP
   offer/answer mechanism [RFC3264].  Declarative usage of SDP is out of
   scope of this document, and is thus undefined.

5.  SDP Grouping Framework BUNDLE Extension

   This section defines a new SDP Grouping Framework extension
   [RFC5888], 'BUNDLE'.  The BUNDLE extension can be used with the SDP
   Offer/Answer mechanism to negotiate the usage of a single
   address:port combination (BUNDLE address) for receiving bundled
   media.

   A single address:port combination is also used for sending bundled
   media.  The address:port combination used for sending bundled media
   MAY be the same as the BUNDLE address, used to receive bundled media,
   depending on whether symmetric RTP [RFC4961] is used.

   All media specified by a BUNDLE group share a single 5-tuple, i.e. in
   addition to using a single address:port combination all bundled media
   MUST be transported using the same transport-layer protocol (e.g.
   UDP or TCP).

   The BUNDLE extension is indicated using an SDP 'group' attribute with
   a "BUNDLE" semantics value [RFC5888].  An identification-tag is
   associated with each bundled "m=" line, and each identification-tag
   is listed in the SDP 'group:BUNDLE' attribute identification-tag
   list.  Each "m=" line whose identification-tag is listed in the
   identification-tag list is associated with a given BUNDLE group.

   SDP bodies can contain multiple BUNDLE groups.  Any given bundled
   "m=" line MUST NOT be associated with more than one BUNDLE group.



Holmberg, et al.        Expires December 21, 2016               [Page 7]

Internet-Draft                Bundled media                    June 2016


   Section 8 defines the detailed SDP Offer/Answer procedures for the
   BUNDLE extension.

6.  SDP 'bundle-only' Attribute

   This section defines a new SDP media-level attribute [RFC4566],
   'bundle-only'. 'bundle-only' is a property attribute [RFC4566], and
   hence has no value.


      Name: bundle-only

      Value: N/A

      Usage Level: media

      Charset Dependent: no

      Example:

         a=bundle-only


   In order to ensure that an answerer that does not support the BUNDLE
   extension always rejects a bundled "m=" line, the offerer can assign
   a zero port value to the "m=" line.  According to [RFC4566] an
   answerer will reject such "m=" line.  By associating an SDP 'bundle-
   only' attribute with such "m=" line, the offerer can request that the
   answerer accepts the "m=" line if the answerer supports the Bundle
   extension, and if the answerer keeps the "m=" line within the
   associated BUNDLE group.

   NOTE: Once the offerer BUNDLE address has been selected, the offerer
   does not need to include the 'bundle-only' attribute in subsequent
   offers.  By associating the offerer BUNDLE address with an "m=" line
   of a subsequent offer, the offerer will ensure that the answerer will
   either keep the "m=" line within the BUNDLE group, or the answerer
   will have to reject the "m=" line.

   The usage of the 'bundle-only' attribute is only defined for a
   bundled "m=" line with a zero port value, within an offer.  Other
   usage is unspecified.

   Section 8 defines the detailed SDP Offer/Answer procedures for the
   'bundle-only' attribute.






Holmberg, et al.        Expires December 21, 2016               [Page 8]

Internet-Draft                Bundled media                    June 2016


7.  SDP Information Considerations

7.1.  General

   This section describes restrictions associated with the usage of SDP
   parameters within a BUNDLE group.  It also describes, when parameter
   and attribute values have been associated with each bundled "m="
   line, how to calculate a value for the whole BUNDLE group.

7.2.  Connection Data (c=)

   The "c=" line nettype value [RFC4566] associated with a bundled "m="
   line MUST be 'IN'.

   The "c=" line addrtype value [RFC4566] associated with a bundled "m="
   line MUST be 'IP4' or 'IP6'.  The same value MUST be associated with
   each "m=" line.

   NOTE: Extensions to this specification can specify usage of the
   BUNDLE mechanism for other nettype and addrtype values than the ones
   listed above.

7.3.  Bandwidth (b=)

   An offerer and answerer MUST use the rules and restrictions defined
   in [I-D.ietf-mmusic-sdp-mux-attributes] for when associating the SDP
   bandwidth (b=) line with bundled "m=" lines.

7.4.  Attributes (a=)

   An offerer and answerer MUST use the rules and restrictions defined
   in [I-D.ietf-mmusic-sdp-mux-attributes] for when associating SDP
   attributes with bundled "m=" lines.

8.  SDP Offer/Answer Procedures

8.1.  General

   This section describes the SDP Offer/Answer [RFC3264] procedures for:

   o  Negotiating and creating of a BUNDLE group; and

   o  Selecting the BUNDLE addresses (offerer BUNDLE address and
      answerer BUNDLE address); and

   o  Adding an "m=" line to a BUNDLE group; and

   o  Moving an "m=" line out of a BUNDLE group; and



Holmberg, et al.        Expires December 21, 2016               [Page 9]

Internet-Draft                Bundled media                    June 2016


   o  Disabling an "m=" line within a BUNDLE group.

   The generic rules and procedures defined in [RFC3264] and [RFC5888]
   also apply to the BUNDLE extension.  For example, if an offer is
   rejected by the answerer, the previously negotiated SDP parameters
   and characteristics (including those associated with a BUNDLE group)
   apply.  Hence, if an offerer generates an offer in which the offerer
   wants to create a BUNDLE group, and the answerer rejects the offer,
   the BUNDLE group is not created.

   The procedures in this section are independent of the media type or
   "m=" line proto value represented by a bundled "m=" line.  Section 10
   defines additional considerations for RTP based media.  Section 6
   defines additional considerations for the usage of the SDP 'bundle-
   only' attribute.  Section 11 defines additional considerations for
   the usage of Interactive Connectivity Establishment (ICE)
   [I-D.ietf-ice-rfc5245bis] mechanism.

   SDP offers and answers can contain multiple BUNDLE groups.  The
   procedures in this section apply independently to a given BUNDLE
   group.

8.2.  Mux Category Considerations

   When an offerer associates a shared address with a bundled "m=" line,
   the offerer shall associate IDENTICAL and TRANSPORT mux category SDP
   attributes [I-D.ietf-mmusic-sdp-mux-attributes] with the "m=" line
   only if the "m=" line is associated with the offerer BUNDLE-tag.
   Otherwise the offerer MUST NOT associate such SDP attributes with the
   "m=" line.

   When an answerer associates a shared address with a bundled "m="
   line, the answerer shall associate IDENTICAL and TRANSPORT category
   SDP attributes with the "m=" line only if the "m=" line is associated
   with the answerer BUNDLE-tag.  Otherwise the answerer MUST NOT
   associate such SDP attributes with the "m=" line.

   NOTE: As bundled "m=" lines associated with a shared address will
   share the same IDENTICAL and TRANSPORT mux category SDP attributes,
   and attribute values, there is no need to associate such SDP
   attributes with each "m=" line.

8.3.  Generating the Initial SDP Offer








Holmberg, et al.        Expires December 21, 2016              [Page 10]

Internet-Draft                Bundled media                    June 2016


8.3.1.  General

   When an offerer generates an initial offer, in order to create a
   BUNDLE group, it MUST:

   o  Assign a unique address to each "m=" line within the offer,
      following the procedures in [RFC3264], unless the media line is a
      'bundle-only' "m=" line (see below); and

   o  Add an SDP 'group:BUNDLE' attribute to the offer; and

   o  Place the identification-tag of each bundled "m=" line in the SDP
      'group:BUNDLE' attribute identification-tag list; and

   o  Indicate which unique address the offerer suggests as the offerer
      BUNDLE address [Section 8.3.2].

   If the offerer wants to request that the answerer accepts a given
   bundled "m=" line only if the answerer keeps the "m=" line within the
   BUNDLE group, the offerer MUST:

   o  Associate an SDP 'bundle-only' attribute [Section 8.3.2] with the
      "m=" line; and

   o  Assign a zero port value to the "m=" line.

   NOTE: If the offerer assigns a zero port value to an "m=" line, but
   does not also associate an SDP 'bundle-only' attribute with the "m="
   line, it is an indication that the offerer wants to disable the "m="
   line [Section 8.6.5].

   [Section 17.1] shows an example of an initial offer.

8.3.2.  Suggesting the offerer BUNDLE address

   In the offer, the address associated with the "m=" line associated
   with the offerer BUNDLE-tag indicates the address that the offerer
   suggests as the offerer BUNDLE address.

   The "m=" line associated with the offerer BUNDLE-tag MUST NOT contain
   a zero port value or an SDP 'bundle-only' attribute.

8.4.  Generating the SDP Answer








Holmberg, et al.        Expires December 21, 2016              [Page 11]

Internet-Draft                Bundled media                    June 2016


8.4.1.  General

   When an answerer generates an answer that contains a BUNDLE group,
   the following general SDP grouping framework restrictions, defined in
   [RFC5888], also apply to the BUNDLE group:

   o  The answerer MUST NOT include a BUNDLE group in the answer, unless
      the offerer requested the BUNDLE group to be created in the
      corresponding offer; and

   o  The answerer MUST NOT include an "m=" line within a BUNDLE group,
      unless the offerer requested the "m=" line to be within that
      BUNDLE group in the corresponding offer.

   If the answer contains a BUNDLE group, the answerer MUST:

   o  Select an Offerer BUNDLE Address [Section 8.4.2]; and

   o  Select an Answerer BUNDLE Address [Section 8.4.3];

   The answerer is allowed to select a new Answerer BUNDLE address each
   time it generates an answer to an offer.

   If the answerer does not want to keep an "m=" line within a BUNDLE
   group, it MUST:

   o  Move the "m=" line out of the BUNDLE group [Section 8.4.4]; or

   o  Reject the "m=" line [Section 8.4.5];

   If the answerer keeps a bundle-only "m=" line within the BUNDLE
   group, it follows the procedures (associates the answerer BUNDLE
   address with the "m=" line etc) for any other "m=" line kept within
   the BUNDLE group.

   If the answerer does not want to keep a bundle-only "m=" line within
   the BUNDLE group, it MUST reject the "m=" line [Section 8.4.5].

   The answerer MUST NOT associate an SDP 'bundle-only' attribute with
   any "m=" line in an answer.

   NOTE: If a bundled "m=" line in an offer contains a zero port value,
   but the "m=" line does not contain an SDP 'bundle-only' attribute, it
   is an indication that the offerer wants to disable the "m=" line
   [Section 8.6.5].






Holmberg, et al.        Expires December 21, 2016              [Page 12]

Internet-Draft                Bundled media                    June 2016


8.4.2.  Answerer Selection of Offerer Bundle Address

   In an offer, the address (unique or shared) associated with the
   bundled "m=" line associated with the offerer BUNDLE-tag indicates
   the address that the offerer suggests as the offerer BUNDLE address
   [Section 8.3.2].  The answerer MUST check whether that "m=" line
   fulfils the following criteria:

   o  The answerer will not move the "m=" line out of the BUNDLE group
      [Section 8.4.4]; and

   o  The answerer will not reject the "m=" line [Section 8.4.5]; and

   o  The "m=" line does not contain a zero port value.

   If all of the criteria above are fulfilled, the answerer MUST select
   the address associated with the "m=" line as the offerer BUNDLE
   address.  In the answer, the answerer BUNDLE-tag represents the "m="
   line, and the address associated with the "m=" line in the offer
   becomes the offerer BUNDLE address.

   If one or more of the criteria are not fulfilled, the answerer MUST
   select the next identification-tag in the identification-tag list,
   and perform the same criteria check for the "m=" line associated with
   that identification-tag.  If there are no more identification-tags in
   the identification-tag list, the answerer MUST NOT create the BUNDLE
   group.  In addition, unless the answerer rejects the whole offer, the
   answerer MUST apply the answerer procedures for moving an "m=" line
   out of a BUNDLE group [Section 8.4.4] to each bundled "m=" line in
   the offer when creating the answer.

   [Section 17.1] shows an example of an offerer BUNDLE address
   selection.

8.4.3.  Answerer Selection of Answerer BUNDLE Address

   When the answerer selects a BUNDLE address for itself, referred to as
   the answerer BUNDLE address, it MUST associate that address with each
   bundled "m=" line within the created BUNDLE group in the answer.

   The answerer MUST NOT associate the answerer BUNDLE address with an
   "m=" line that is not within the BUNDLE group, or to an "m=" line
   that is within another BUNDLE group.

   [Section 17.1] shows an example of an answerer BUNDLE address
   selection.





Holmberg, et al.        Expires December 21, 2016              [Page 13]

Internet-Draft                Bundled media                    June 2016


8.4.4.  Moving A Media Description Out Of A BUNDLE Group

   When an answerer wants to move an "m=" line out of a BUNDLE group, it
   MUST first check the following criteria:

   o  In the corresponding offer, the "m=" line is associated with a
      shared address (e.g. a previously selected offerer BUNDLE
      address); or

   o  In the corresponding offer, if an SDP 'bundle-only' attribute is
      associated with the "m=" line, and if the "m=" line contains a
      zero port value.

   If either criteria above is fulfilled, the answerer MUST reject the
   "m=" line [Section 8.4.5].

   Otherwise, if in the corresponding offer the "m=" line is associated
   with a unique address, the answerer MUST associate a unique address
   with the "m=" line in the answer (the answerer does not reject the
   "m=" line).

   In addition, in either case above, the answerer MUST NOT place the
   identification-tag, associated with the moved "m=" line, in the SDP
   'group' attribute identification-tag list associated with the BUNDLE
   group.

8.4.5.  Rejecting A Media Description In A BUNDLE Group

   When an answerer rejects an "m=" line, it MUST associate an address
   with a zero port value with the "m=" line in the answer, according to
   the procedures in [RFC4566].

   In addition, the answerer MUST NOT place the identification-tag,
   associated with the rejected "m=" line, in the SDP 'group' attribute
   identification-tag list associated with the BUNDLE group.

8.5.  Offerer Processing of the SDP Answer

   When an offerer receives an answer, if the answer contains a BUNDLE
   group, the offerer MUST check that any bundled "m=" line in the
   answer was indicated as bundled in the corresponding offer.  If there
   is no mismatch, the offerer MUST use the offerer BUNDLE address,
   selected by the answerer [Section 8.4.2], as the address for each
   bundled "m=" line.

   NOTE: As the answerer might reject one or more bundled "m=" lines, or
   move a bundled "m=" line out of a BUNDLE group, each bundled "m="
   line in the offer might not be indicated as bundled in the answer.



Holmberg, et al.        Expires December 21, 2016              [Page 14]

Internet-Draft                Bundled media                    June 2016


   If the answer does not contain a BUNDLE group, the offerer MUST
   process the answer as a normal answer.

8.6.  Modifying the Session

8.6.1.  General

   When an offerer generates a subsequent offer, it MUST associate the
   previously selected offerer BUNDLE address [Section 8.4.2] with each
   bundled "m=" line (including any bundle-only "m=" line), except if:

   o  The offerer suggests a new offerer BUNDLE address [Section 8.6.2];
      or

   o  The offerer wants to add a bundled "m=" line to the BUNDLE group
      [Section 8.6.3]; or

   o  The offerer wants to move a bundled "m=" line out of the BUNDLE
      group [Section 8.6.4]; or

   o  The offerer wants to disable the bundled "m=" line
      [Section 8.6.5].

   In addition, the offerer MUST select an offerer BUNDLE-tag
   [Section 8.3.2] associated with the previously selected offerer
   BUNDLE address, unless the offerer suggests a new offerer BUNDLE
   address.

8.6.2.  Suggesting a new offerer BUNDLE address

   When an offerer generates an offer, in which it suggests a new
   offerer BUNDLE address [Section 8.3.2], the offerer MUST:

   o  Assign the address (shared address) to each "m=" line within the
      BUNDLE group; or

   o  Assign the address (unique address) to one bundled "m=" line.

   In addition, the offerer MUST indicate that the address is the new
   suggested offerer BUNDLE address [Section 8.3.2].

   NOTE: Unless the offerer associates the new suggested offerer BUNDLE
   address with each bundled "m=" line, it can associate unique
   addresses with any number of bundled "m=" lines (and the previously
   selected offerer BUNDLE address to any remaining bundled "m=" line)
   if it wants to suggest multiple alternatives for the new offerer
   BUNDLE address.




Holmberg, et al.        Expires December 21, 2016              [Page 15]

Internet-Draft                Bundled media                    June 2016


8.6.3.  Adding a media description to a BUNDLE group

   When an offerer generates an offer, in which it wants to add a
   bundled "m=" line to a BUNDLE group, the offerer MUST:

   o  Assign a unique address to the added "m=" line; or

   o  Assign the previously selected offerer BUNDLE address to the added
      "m=" line; or

   o  If the offerer associates a new (shared address) suggested offerer
      BUNDLE address with each bundled "m=" line [Section 8.6.2], also
      associate that address with the added "m=" line.

   In addition, the offerer MUST extend the SDP 'group:BUNDLE' attribute
   identification-tag list with the BUNDLE group [Section 8.3.2] by
   adding the identification-tag associated with the added "m=" line to
   the list.

   NOTE: Assigning a unique address to the "m=" line allows the answerer
   to move the "m=" line out of the BUNDLE group [Section 8.4.4],
   without having to reject the "m=" line.

   If the offerer associates a unique address with the added "m=" line,
   and if the offerer suggests that address as the new offerer BUNDLE
   address [Section 8.6.2], the offerer BUNDLE-tag MUST represent the
   added "m=" line [Section 8.3.2].

   If the offerer associates a new suggested offerer BUNDLE address with
   each bundled "m=" line [Section 8.6.2], including the added "m="
   line, the offerer BUNDLE-tag MAY represent the added "m=" line
   [Section 8.3.2].

   [Section 17.3] shows an example where an offerer sends an offer in
   order to add a bundled "m=" line to a BUNDLE group.

8.6.4.  Moving A Media Description Out Of A BUNDLE Group

   When an offerer generates an offer, in which it wants to move a
   bundled "m=" line out of a BUNDLE group it was added to in a previous
   offer/answer transaction, the offerer:

   o  MUST associate a unique address with the "m=" line; and

   o  MUST NOT place the identification-tag associated with the "m="
      line in the SDP 'group:BUNDLE' attribute identification-tag list
      associated with the BUNDLE group.




Holmberg, et al.        Expires December 21, 2016              [Page 16]

Internet-Draft                Bundled media                    June 2016


   NOTE: If the removed "m=" line is associated with the previously
   selected BUNDLE-tag, the offerer needs to suggest a new BUNDLE-tag
   [Section 8.3.2].

   NOTE: If an "m=" line, when being moved out of a BUNDLE group, is
   added to another BUNDLE group, the offerer applies the procedures in
   [Section 8.6.3] to the "m=" line.

   [Section 17.4] shows an example of an offer for moving an "m=" line
   out of a BUNDLE group.

8.6.5.  Disabling A Media Description In A BUNDLE Group

   When an offerer generates an offer, in which it wants to disable a
   bundled "m=" line (added to the BUNDLE group in a previous offer/
   answer transaction), the offerer:

   o  MUST associate an address with a zero port value with the "m="
      line, following the procedures in [RFC4566]; and

   o  MUST NOT place the identification-tag associated with the "m="
      line in the SDP 'group:BUNDLE' attribute identification-tag list
      associated with the BUNDLE group.

   [Section 17.5] shows an example of an offer for disabling an "m="
   line within a BUNDLE group.

9.  Protocol Identification

9.1.  General

   Each "m=" line within a BUNDLE group MUST use the same transport-
   layer protocol.  If bundled "m=" lines use different protocols on top
   of the transport-layer protocol, there MUST exist a publicly
   available specification which describes a mechanism, for this
   particular protocol combination, how to associate received data with
   the correct protocol.

   In addition, if received data can be associated with more than one
   bundled "m=" line, there MUST exist a publicly available
   specification which describes a mechanism for associating the
   received data with the correct "m=" line.

   This document describes a mechanism to identify the protocol of
   received data among the STUN, DTLS and SRTP protocols (in any
   combination), when UDP is used as transport-layer protocol, but does
   not describe how to identify different protocols transported on DTLS.
   While the mechanism is generally applicable to other protocols and



Holmberg, et al.        Expires December 21, 2016              [Page 17]

Internet-Draft                Bundled media                    June 2016


   transport-layers protocols, any such use requires further
   specification around how to multiplex multiple protocols on a given
   transport-layer protocols, and how to associate received data with
   the correct protocols.

9.2.  STUN, DTLS, SRTP

   Section 5.1.2 of [RFC5764] describes a mechanism to identify the
   protocol of a received packet among the STUN, Datagram Transport
   Layer Security (DTLS) and SRTP protocols (in any combination).  If an
   offer or answer includes bundled "m=" lines that represent these
   protocols, the offerer or answerer MUST support the mechanism
   described in [RFC5764], and no explicit negotiation is required in
   order to indicate support and usage of the mechanism.

   [RFC5764] does not describe how to identify different protocols
   transported on DTLS, only how to identify the DTLS protocol itself.
   If multiple protocols are transported on DTLS, there MUST exist a
   specification describing a mechanism for identifying each individual
   protocol.  In addition, if a received DTLS packet can be associated
   with more than one "m=" line, there MUST exist a specification which
   describes a mechanism for associating the received DTLS packet with
   the correct "m=" line.

   [Section 10.2] describes how to associate a received (S)RTP packet
   with the correct "m=" line.

10.  RTP Considerations

10.1.  Single RTP Session

10.1.1.  General

   All RTP-based media within a single BUNDLE group belong to a single
   RTP session [RFC3550].  Disjoint BUNDLE groups will form multiple RTP
   sessions, one per BUNDLE group.

   Since a single RTP session is used for each bundle group, all "m="
   lines representing RTP-based media in a bundle group will share a
   single SSRC numbering space [RFC3550].

   The following rules and restrictions apply for a single RTP session:

   o  A specific payload type value can be used in multiple bundled "m="
      lines if each codec associated with the payload type number shares
      an identical codec configuration [Section 10.1.2].





Holmberg, et al.        Expires December 21, 2016              [Page 18]

Internet-Draft                Bundled media                    June 2016


   o  The proto value in each bundled RTP-based "m=" line MUST be
      identical (e.g.  RTP/AVPF).

   o  The RTP MID header extension MUST be enabled, by associating an
      SDP 'extmap' attribute [RFC5285], with a 'urn:ietf:params:rtp-
      hdrext:sdes:mid' URI value, with each bundled RTP-based "m=" line
      in every offer and answer.

   o  A given SSRC MUST NOT transmit RTP packets using payload types
      that originate from different bundled "m=" lines.

   NOTE: The last bullet above is to avoid sending multiple media types
   from the same SSRC.  If transmission of multiple media types are done
   with time overlap, RTP and RTCP fail to function.  Even if done in
   proper sequence this causes RTP Timestamp rate switching issues
   [RFC7160].  However, once an SSRC has left the RTP session (by
   sending an RTCP BYE packet), that SSRC can be reused by another
   source (possibly associated with a different bundled "m=" line) after
   a delay of 5 RTCP reporting intervals (the delay is to ensure the
   SSRC has timed out, in case the RTCP BYE packet was lost [RFC3550]).

10.1.2.  Payload Type (PT) Value Reuse

   Multiple bundled "m=" lines might represent RTP based media.  As all
   RTP based media specified by a BUNDLE group belong to the same RTP
   session, in order for a given payload type value to be used inside
   more than one bundled "m=" line, all codecs associated with the
   payload type number MUST share an identical codec configuration.
   This means that the codecs MUST share the same media type, encoding
   name, clock rate and any parameter that can affect the codec
   configuration and packetization.
   [I-D.ietf-mmusic-sdp-mux-attributes] lists SDP attributes, whose
   attribute values must be identical for all codecs that use the same
   payload type value.

10.2.  Associating RTP/RTCP Packets With Correct SDP Media Description

   There are multiple mechanisms that can be used by an endpoint in
   order to associate received RTP/RTCP packets with a bundled "m="
   line.  Such mechanisms include using the payload type value carried
   inside the RTP packets, the SSRC values carried inside the RTP
   packets, and other "m=" line specific information carried inside the
   RTP packets.

   As all RTP/RTCP packets associated with a BUNDLE group are received
   (and sent) using single address:port combinations, the local
   address:port combination cannot be used to associate received RTP
   packets with the correct "m=" line.



Holmberg, et al.        Expires December 21, 2016              [Page 19]

Internet-Draft                Bundled media                    June 2016


   As described in [Section 10.1.2], the same payload type value might
   be used inside RTP packets described by multiple "m=" lines.  In such
   cases, the payload type value cannot be used to associate received
   RTP packets with the correct "m=" line.

   An offerer and answerer can inform each other which SSRC values they
   will use for RTP and RTCP by using the SDP 'ssrc' attribute
   [RFC5576].  To allow for proper association with this mechanism, the
   'ssrc' attribute needs to be associated with each "m=" line that
   shares a payload type with any other "m=" line in the same bundle.
   As the SSRC values will be carried inside the RTP/RTCP packets, the
   offerer and answerer can then use that information to associate
   received RTP packets with the correct "m=" line.  However, an offerer
   will not know which SSRC values the answerer will use until it has
   received the answer providing that information.  Due to this, before
   the offerer has received the answer, the offerer will not be able to
   associate received RTP/RTCP packets with the correct "m=" line using
   the SSRC values.

   In order for an offerer and answerer to always be able to associate
   received RTP and RTCP packets with the correct "m=" line, an offerer
   and answerer using the BUNDLE extension MUST support the mechanism
   defined in Section 14, where the remote endpoint inserts the
   identification-tag associated with an "m=" line in RTP and RTCP
   packets associated with that "m=" line.

10.3.  RTP/RTCP Multiplexing

10.3.1.  General

   Within a BUNDLE group, the offerer and answerer MUST enable RTP/RTCP
   multiplexing [RFC5761] for the RTP-based media specified by the
   BUNDLE group.

   When RTP/RTCP multiplexing is enabled, the same address:port
   combination will be used for sending all RTP packets and the RTCP
   packets associated with the BUNDLE group.  Each endpoint will send
   the packets towards the BUNDLE address of the other endpoint.  The
   same address:port combination MAY be used for receiving RTP packets
   and RTCP packets.

10.3.2.  SDP Offer/Answer Procedures

10.3.2.1.  General

   This section describes how an offerer and answerer use the SDP 'rtcp-
   mux' attribute [RFC5761] and the SDP 'rtcp-mux-only' attribute




Holmberg, et al.        Expires December 21, 2016              [Page 20]

Internet-Draft                Bundled media                    June 2016


   [I-D.ietf-mmusic-mux-exclusive] to negotiate usage of RTP/RTCP
   multiplexing for RTP-based media specified by a BUNDLE group.

   The procedures in this section only apply to RTP-based "m=" lines.

10.3.2.2.  Generating the Initial SDP Offer

   When an offerer generates an initial offer, the offerer MUST
   associate either an SDP 'rtcp-mux' attribute [RFC5761] or an SDP
   'rtcp-mux-only' attribute [I-D.ietf-mmusic-mux-exclusive] with each
   bundled RTP-based "m=" line in the offer.  The offerer MUST associate
   an SDP 'rtcp-mux-only' attribute with each bundle-only "m=" line.  If
   the offerer associates a 'rtcp-mux-only' attribute with an "m=" line,
   the offerer may also associate a 'rtcp-mux' attribute with the same
   "m=" line, as described in [I-D.ietf-mmusic-mux-exclusive].

   NOTE: Within a BUNDLE group, the offerer can associate the SDP 'rtcp-
   mux' attribute with some of the RTP-based "m=" lines, while it
   associates the SDP 'rtcp-mux-only' attribute to other RTP-based "m="
   lines, depending on whether the offerer supports fallback to usage of
   a separate port for RTCP in case the answerer does not include the
   "m=" line in the BUNDLE group.

   NOTE: If the offerer associates an SDP 'rtcp-mux' attribute with an
   "m=" line, the offerer can also associate an SDP 'rtcp' attribute
   [RFC3605] with a bundled "m=" line, excluding a bundle-only "m="
   line, in order to provide a fallback port for RTCP, as described in
   [RFC5761].  However, the fallback port will only be used in case the
   answerer does not include the "m=" line in the BUNDLE group in the
   associated answer.

   In the initial offer, the address:port combination for RTCP MUST be
   unique in each bundled RTP-based "m=" line (excluding a 'bundle-only'
   "m=" line), similar to RTP.

10.3.2.3.  Generating the SDP Answer

   When an answerer generates an answer, if the answerer accepts one or
   more RTP-based "m=" lines within a BUNDLE group, the answerer MUST
   enable usage of RTP/RTCP multiplexing.  The answerer MUST associate
   an SDP "rtcp-mux" attribute with each RTP-based "m=" line in the
   answer.  In addition, if an "m=" line in the corresponding offer
   contained an SDP "rtcp-mux-only" attribute, the answerer MUST also
   associate an SDP "rtcp-mux-only" attribute with the "m=" line in the
   answer.

   If an RTP-based "m=" line in the corresponding offer did not contain
   an SDP "rtcp-mux" attribute or an SDP "rtcp-mux-only" attribute, the



Holmberg, et al.        Expires December 21, 2016              [Page 21]

Internet-Draft                Bundled media                    June 2016


   answerer MUST NOT include the "m=" line within a BUNDLE group in the
   answer.

   If an RTP-based "m=" line in the corresponding offer contained an SDP
   "rtcp-mux-only" attribute, and if the answerer moves the "m=" line
   out of the BUNDLE group in the answer Section 8.4.4, the answerer
   MUST still either enable RTP/RTCP multiplexing for the media
   associated with the "m=" line, or reject the "m=" line Section 8.4.5.

   The answerer MUST NOT associate an SDP 'rtcp' attribute with any
   bundled "m=" line in the answer.  The answerer will use the port
   value of the selected offerer BUNDLE address for sending RTP and RTCP
   packets associated with each RTP-based bundled "m=" line towards the
   offerer.

   If the usage of RTP/RTCP multiplexing within a BUNDLE group has been
   negotiated in a previous offer/answer transaction, the answerer MUST
   associate an SDP 'rtcp-mux' attribute with each bundled RTP-based
   "m=" line in the answer.

10.3.2.4.  Offerer Processing of the SDP Answer

   When an offerer receives an answer, if the answerer has accepted the
   usage of RTP/RTCP multiplexing (see Section 10.3.2.3), the answerer
   follows the procedures for RTP/RTCP multiplexing defined in
   [RFC5761].  The offerer will use the port value associated with the
   answerer BUNDLE address for sending RTP and RTCP packets associated
   with each RTP-based bundled "m=" line towards the answerer.

   NOTE: It is considered a protocol error if the answerer has not
   accepted the usage of RTP/RTCP multiplexing for RTP-based "m=" lines
   that the answerer included in the BUNDLE group.

10.3.2.5.  Modifying the Session

   When an offerer generates a subsequent offer, it MUST associate an
   SDP 'rtcp-mux' attribute or an SDP 'rtcp-mux-only' attribute with
   each RTP-based bundled "m=" line within the BUNDLE group (including
   any bundled RTP-based "m=" line that the offerer wants to add to the
   BUNDLE group), unless the offerer wants to disable or remove the "m="
   line from the BUNDLE group.

11.  ICE Considerations








Holmberg, et al.        Expires December 21, 2016              [Page 22]

Internet-Draft                Bundled media                    June 2016


11.1.  General

   This section describes how to use the BUNDLE grouping extension
   together with the Interactive Connectivity Establishment (ICE)
   mechanism [I-D.ietf-ice-rfc5245bis].

   The generic procedures for negotiating usage of ICE using SDP,
   defined in [I-D.ietf-mmusic-ice-sip-sdp], also apply to usage of ICE
   with BUNDLE, with the following exceptions:

   o  When BUNDLE addresses for a BUNDLE group have been selected for
      both endpoints, ICE connectivity checks and keep-alives only need
      to be performed for the whole BUNDLE group, instead of per bundled
      "m=" line.

   o  Among bundled "m=" lines with which the offerer has associated a
      shared address, the offerer only associates ICE-related media-
      level SDP attributes with the "m=" line associated with the
      offerer BUNDLE-tag.

   o  Among bundled "m=" lines with which the answerer has associated a
      shared address, the answerer only associates ICE-related media-
      level SDP attributes with the "m=" line associated with the
      answerer BUNDLE-tag.

   Support and usage of ICE mechanism together with the BUNDLE extension
   is OPTIONAL.

11.2.  SDP Offer/Answer Procedures

11.2.1.  General

   When an offerer associates a unique address with a bundled "m=" line
   (excluding any bundle-only "m=" line), the offerer MUST associate SDP
   'candidate' attributes (and other applicable ICE-related media-level
   SDP attributes), containing unique ICE properties (candidates etc),
   with the "m=" line, according to the procedures in
   [I-D.ietf-mmusic-ice-sip-sdp].

   When an offerer associates a shared address with a bundled "m=" line,
   if the "m=" line is associated with the offerer BUNDLE-tag, the
   offerer MUST associate SDP 'candidate' attributes (and other
   applicable ICE-related media-level SDP attributes), containing shared
   ICE properties, with the "m=" line.  If the "m=" line is not
   associated with the offerer BUNDLE-tag, the offerer MUST NOT
   associate ICE-related SDP attributes with the "m=" line.





Holmberg, et al.        Expires December 21, 2016              [Page 23]

Internet-Draft                Bundled media                    June 2016


   When an answerer associates a shared address with a bundled "m="
   line, if the "m=" line is associated with the answerer BUNDLE-tag,
   the answerer MUST associate SDP 'candidate' attributes (and other
   applicable ICE-related media-level SDP attributes), containing shared
   ICE properties, with the "m=" line.  If the "m=" line is not
   associated with the answerer BUNDLE-tag, the answerer MUST NOT
   associate ICE-related SDP attributes with the "m=" line.

   NOTE: As most ICE-related media-level SDP attributes belong to the
   TRANSPORT mux category [I-D.ietf-mmusic-sdp-mux-attributes], the
   offerer and answerer follow the rules in Section 8.2.  However, in
   the case of ICE-related media-level attributes, the rules apply to
   all attributes (see note below), even if they belong to a different
   mux category.

   NOTE: The following ICE-related media-level SDP attributes are
   defined in [I-D.ietf-mmusic-ice-sip-sdp]: 'candidiate', 'remote-
   candidates', 'ice-mismatch', 'ice-ufrag', 'ice-pwd', and 'ice-
   pacing'.

11.2.2.  Generating the Initial SDP Offer

   When an offerer generates an initial offer, the offerer MUST
   associate ICE-related media-level SDP attributes with each bundled
   "m=" line, according to [Section 11.2.1].

11.2.3.  Generating the SDP Answer

   When an answerer generates an answer that contains a BUNDLE group,
   the answerer MUST associated ICE-related SDP attributes with the "m="
   line associated with the answerer BUNDLE-tag, according to
   [Section 11.2.1].

11.2.4.  Offerer Processing of the SDP Answer

   When an offerer receives an answer, if the answerer supports and uses
   the ICE mechanism and the BUNDLE extension, the offerer MUST
   associate the ICE properties associated with the offerer BUNDLE
   address, selected by the answerer [Section 8.4.2], with each bundled
   "m=" line.

11.2.5.  Modifying the Session

   When an offerer generates a subsequent offer, it MUST associated
   unique or shared ICE properties to one or more bundled "m=" lines,
   according to [Section 11.2.1].





Holmberg, et al.        Expires December 21, 2016              [Page 24]

Internet-Draft                Bundled media                    June 2016


12.  DTLS Considerations

   One or more media streams within a BUNDLE group might use the
   Datagram Transport Layer Security (DTLS) protocol [RFC6347] in order
   to encrypt the data, or to negotiate encryption keys if another
   encryption mechanism is used to encrypt media.

   When DTLS is used within a BUNDLE group, the following rules apply:

   o  There can only be one DTLS association [RFC6347] associated with
      the BUNDLE group; and

   o  Each usage of the DTLS association within the BUNDLE group MUST
      use the same mechanism for determining which endpoints (the
      offerer or answerer) becomes DTLS client and DTLS server; and

   o  Each usage of the DTLS association within the Bundle group MUST
      use the same mechanism for determining whether an offer or answer
      will trigger the establishment of a new DTLS association, or
      whether an existing DTLS association will be used; and

   o  If the DTLS client supports DTLS-SRTP [RFC5764] it MUST include
      the 'use_srtp' extension [RFC5764] in the DTLS ClientHello message
      [RFC5764], The client MUST include the extension even if the usage
      of DTLS-SRTP is not negotiated as part of the multimedia session
      (e.g.  SIP session [RFC3261].

   NOTE: The inclusion of the 'use_srtp' extension during the initial
   DTLS handshake ensures that a DTLS renegotiation will not be required
   in order to include the extension, in case DTLS-SRTP encrypted media
   is added to the BUNDLE group later during the multimedia session.

13.  Update to RFC 3264

13.1.  General

   This section replaces the text of the following sections of RFC 3264:

   o  Section 5.1 (Unicast Streams).

   o  Section 8.2 (Removing a Media Stream).

   o  Section 8.4 (Putting a Unicast Media Stream on Hold).








Holmberg, et al.        Expires December 21, 2016              [Page 25]

Internet-Draft                Bundled media                    June 2016


13.2.  Original text of section 5.1 (2nd paragraph) of RFC 3264

   For recvonly and sendrecv streams, the port number and address in the
   offer indicate where the offerer would like to receive the media
   stream.  For sendonly RTP streams, the address and port number
   indirectly indicate where the offerer wants to receive RTCP reports.
   Unless there is an explicit indication otherwise, reports are sent to
   the port number one higher than the number indicated.  The IP address
   and port present in the offer indicate nothing about the source IP
   address and source port of RTP and RTCP packets that will be sent by
   the offerer.  A port number of zero in the offer indicates that the
   stream is offered but MUST NOT be used.  This has no useful semantics
   in an initial offer, but is allowed for reasons of completeness,
   since the answer can contain a zero port indicating a rejected stream
   (Section 6).  Furthermore, existing streams can be terminated by
   setting the port to zero (Section 8).  In general, a port number of
   zero indicates that the media stream is not wanted.

13.3.  New text replacing section 5.1 (2nd paragraph) of RFC 3264

   For recvonly and sendrecv streams, the port number and address in the
   offer indicate where the offerer would like to receive the media
   stream.  For sendonly RTP streams, the address and port number
   indirectly indicate where the offerer wants to receive RTCP reports.
   Unless there is an explicit indication otherwise, reports are sent to
   the port number one higher than the number indicated.  The IP address
   and port present in the offer indicate nothing about the source IP
   address and source port of RTP and RTCP packets that will be sent by
   the offerer.  A port number of zero in the offer by default indicates
   that the stream is offered but MUST NOT be used, but an extension
   mechanism might specify different semantics for the usage of a zero
   port value.  Furthermore, existing streams can be terminated by
   setting the port to zero (Section 8).  In general, a port number of
   zero by default indicates that the media stream is not wanted.

13.4.  Original text of section 8.2 (2nd paragraph) of RFC 3264

   A stream that is offered with a port of zero MUST be marked with port
   zero in the answer.  Like the offer, the answer MAY omit all
   attributes present previously, and MAY list just a single media
   format from amongst those in the offer.

13.5.  New text replacing section 8.2 (2nd paragraph) of RFC 3264

   A stream that is offered with a port of zero MUST by default be
   marked with port zero in the answer, unless an extension mechanism,
   which specifies semantics for the usage of a non-zero port value, is
   used.  If the stream is marked with port zero in the answer, the



Holmberg, et al.        Expires December 21, 2016              [Page 26]

Internet-Draft                Bundled media                    June 2016


   answer MAY omit all attributes present previously, and MAY list just
   a single media format from amongst those in the offer."

13.6.  Original text of section 8.4 (6th paragraph) of RFC 3264

   RFC 2543 [10] specified that placing a user on hold was accomplished
   by setting the connection address to 0.0.0.0.  Its usage for putting
   a call on hold is no longer recommended, since it doesn't allow for
   RTCP to be used with held streams, doesn't work with IPv6, and breaks
   with connection oriented media.  However, it can be useful in an
   initial offer when the offerer knows it wants to use a particular set
   of media streams and formats, but doesn't know the addresses and
   ports at the time of the offer.  Of course, when used, the port
   number MUST NOT be zero, which would specify that the stream has been
   disabled.  An agent MUST be capable of receiving SDP with a
   connection address of 0.0.0.0, in which case it means that neither
   RTP nor RTCP should be sent to the peer.

13.7.  New text replacing section 8.4 (6th paragraph) of RFC 3264

   RFC 2543 [10] specified that placing a user on hold was accomplished
   by setting the connection address to 0.0.0.0.  Its usage for putting
   a call on hold is no longer recommended, since it doesn't allow for
   RTCP to be used with held streams, doesn't work with IPv6, and breaks
   with connection oriented media.  However, it can be useful in an
   initial offer when the offerer knows it wants to use a particular set
   of media streams and formats, but doesn't know the addresses and
   ports at the time of the offer.  Of course, when used, the port
   number MUST NOT be zero, if it would specify that the stream has been
   disabled.  However, an extension mechanism might specify different
   semantics of the zero port number usage.  An agent MUST be capable of
   receiving SDP with a connection address of 0.0.0.0, in which case it
   means that neither RTP nor RTCP should be sent to the peer.

14.  RTP/RTCP extensions for identification-tag transport

14.1.  General

   SDP Offerers and Answerers [RFC3264] can associate identification-
   tags with "m=" lines within SDP Offers and Answers, using the
   procedures in [RFC5888].  Each identification-tag uniquely represents
   an "m=" line.

   This section defines a new RTCP SDES item [RFC3550], 'MID', which is
   used to carry identification-tags within RTCP SDES packets.  This
   section also defines a new RTP header extension [RFC5285], which is
   used to carry identification-tags in RTP packets.




Holmberg, et al.        Expires December 21, 2016              [Page 27]

Internet-Draft                Bundled media                    June 2016


   The SDES item and RTP header extension make it possible for a
   receiver to associate received RTCP- and RTP packets with a specific
   "m=" line, with which the receiver has associated an identification-
   tag, even if those "m=" lines are part of the same RTP session.  A
   media recipient informs the media sender about the identification-tag
   associated with an "m=" line through the use of an 'mid' attribute
   [RFC5888].  The media sender then inserts the identification-tag in
   RTCP and RTP packets sent to the media recipient.

   NOTE: This text above defines how identification-tags are carried in
   SDP Offers and Answers.  The usage of other signalling protocols for
   carrying identification-tags is not prevented, but the usage of such
   protocols is outside the scope of this document.

   [RFC3550] defines general procedures regarding the RTCP transmission
   interval.  The RTCP MID SDES item SHOULD be sent in the first few
   RTCP packets sent on joining the session, and SHOULD be sent
   regularly thereafter.  The exact number of RTCP packets in which this
   SDES item is sent is intentionally not specified here, as it will
   depend on the expected packet loss rate, the RTCP reporting interval,
   and the allowable overhead.

   The RTP MID header extension SHOULD be included in some RTP packets
   at the start of the session and whenever the SSRC changes.  It might
   also be useful to include the header extension in RTP packets that
   comprise random access points in the media (e.g., with video
   I-frames).  The exact number of RTP packets in which this header
   extension is sent is intentionally not specified here, as it will
   depend on expected packet loss rate and loss patterns, the overhead
   the application can tolerate, and the importance of immediate receipt
   of the identification-tag.

   For robustness purpose, endpoints need to be prepared for situations
   where the reception of the identification-tag is delayed, and SHOULD
   NOT terminate sessions in such cases, as the identification-tag is
   likely to arrive soon.

14.2.  RTCP MID SDES Item


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      MID=TBD  |     length    | identification-tag          ...
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   The identification-tag payload is UTF-8 encoded, as in SDP.



Holmberg, et al.        Expires December 21, 2016              [Page 28]

Internet-Draft                Bundled media                    June 2016


   The identification-tag is not zero terminated.

   [RFC EDITOR NOTE: Please replace TBD with the assigned SDES
   identifier value.]

14.3.  RTP MID Header Extension

   The payload, containing the identification-tag, of the RTP MID header
   extension element can be encoded using either the one-byte or two-
   byte header [RFC5285].  The identification-tag payload is UTF-8
   encoded, as in SDP.

   The identification-tag is not zero terminated.  Note, that set of
   header extensions included in the packet needs to be padded to the
   next 32-bit boundary using zero bytes [RFC5285].

   As the identification-tag is included in either an RTCP SDES item or
   an RTP header extension, or both, there should be some consideration
   about the packet expansion caused by the identification-tag.  To
   avoid Maximum Transmission Unit (MTU) issues for the RTP packets, the
   header extension's size needs to be taken into account when encoding
   the media.

   It is recommended that the identification-tag is kept short.  Due to
   the properties of the RTP header extension mechanism, when using the
   one-byte header, a tag that is 1-3 bytes will result in that a
   minimal number of 32-bit words are used for the RTP header extension,
   in case no other header extensions are included at the same time.
   Note, do take into account that some single characters when UTF-8
   encoded will result in multiple octets.

15.  IANA Considerations

15.1.  New SDES item

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   [RFC EDITOR NOTE: Please replace TBD with the assigned SDES
   identifier value.]

   This document adds the MID SDES item to the IANA "RTP SDES item
   types" registry as follows:








Holmberg, et al.        Expires December 21, 2016              [Page 29]

Internet-Draft                Bundled media                    June 2016


           Value:          TBD
           Abbrev.:        MID
           Name:           Media Identification
           Reference:      RFCXXXX


15.2.  New RTP Header Extension URI

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   This document defines a new extension URI in the RTP SDES Compact
   Header Extensions sub-registry of the RTP Compact Header Extensions
   registry sub-registry, according to the following data:


     Extension URI: urn:ietf:params:rtp-hdrext:sdes:mid
     Description:   Media identification
     Contact:       christer.holmberg@ericsson.com
     Reference:     RFCXXXX

     The SDES item does not reveal privacy information about the users.
     It is simply used to associate RTP-based media with the correct SDP
     media description (m- line) in the SDP used to negotiate the media.

     The purpose of the extension is for the offerer to be able to
     associate received multiplexed RTP-based media before the offerer
     receives the associated SDP answer.


15.3.  New SDP Attribute

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   This document defines a new SDP media-level attribute, 'bundle-only',
   according to the following data:














Holmberg, et al.        Expires December 21, 2016              [Page 30]

Internet-Draft                Bundled media                    June 2016


          Attribute name:     bundle-only
          Type of attribute:  media
          Subject to charset: No
          Purpose:            Request a media description to be accepted
                          in the answer only if kept within a BUNDLE
                          group by the answerer.
          Appropriate values: N/A
          Contact name:       Christer Holmberg
          Contact e-mail:     christer.holmberg@ericsson.com
          Reference:          RFCXXXX


15.4.  New SDP Group Semantics

   [RFC EDITOR NOTE: Please replace RFCXXXX with the RFC number of this
   document.]

   This document registers the following semantics with IANA in the
   "Semantics for the "group" SDP Attribute" subregistry (under the
   "Session Description Protocol (SDP) Parameters" registry:


       Semantics                              Token   Reference
       -------------------------------------  ------  ---------
       Media bundling                         BUNDLE  [RFCXXXX]


16.  Security Considerations

   The security considerations defined in [RFC3264] and [RFC5888] apply
   to the BUNDLE extension.  Bundle does not change which information
   flows over the network but only changes which addresses and ports
   that information is flowing on and thus has very little impact on the
   security of the RTP sessions.

   When the BUNDLE extension is used, a single set of security
   credentials might be used for all media streams specified by a BUNDLE
   group.

   When the BUNDLE extension is used, the number of SSRC values within a
   single RTP session increases, which increases the risk of SSRC
   collision.  [RFC4568] describes how SSRC collision may weaken SRTP
   and SRTCP encryption in certain situations.








Holmberg, et al.        Expires December 21, 2016              [Page 31]

Internet-Draft                Bundled media                    June 2016


17.  Examples

17.1.  Example: Bundle Address Selection

   The example below shows:

   o  An offer, in which the offerer associates a unique address with
      each bundled "m=" line within the BUNDLE group.

   o  An answer, in which the answerer selects the offerer BUNDLE
      address, and in which selects its own BUNDLE address (the answerer
      BUNDLE address) and associates it with each bundled "m=" line
      within the BUNDLE group.






































Holmberg, et al.        Expires December 21, 2016              [Page 32]

Internet-Draft                Bundled media                    June 2016


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10002 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 20000 RTP/AVP 32
       b=AS:1000
       a=mid:bar
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid










Holmberg, et al.        Expires December 21, 2016              [Page 33]

Internet-Draft                Bundled media                    June 2016


17.2.  Example: BUNDLE Extension Rejected

   The example below shows:

   o  An offer, in which the offerer associates a unique address with
      each bundled "m=" line within the BUNDLE group.

   o  An answer, in which the answerer rejects the offered BUNDLE group,
      and associates a unique address with each "m=" line (following
      normal RFC 3264 procedures).









































Holmberg, et al.        Expires December 21, 2016              [Page 34]

Internet-Draft                Bundled media                    June 2016


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10002 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=rtpmap:0 PCMU/8000
       m=video 30000 RTP/AVP 32
       b=AS:1000
       a=rtpmap:32 MPV/90000



17.3.  Example: Offerer Adds A Media Description To A BUNDLE Group

   The example below shows:

   o  A subsequent offer (the BUNDLE group has been created as part of a
      previous offer/answer transaction), in which the offerer adds a
      new "m=" line, represented by the "zen" identification-tag, to a
      previously negotiated BUNDLE group, associates a unique address
      with the added "m=" line, and associates the previously selected



Holmberg, et al.        Expires December 21, 2016              [Page 35]

Internet-Draft                Bundled media                    June 2016


      offerer BUNDLE address with each of the other bundled "m=" lines
      within the BUNDLE group.

   o  An answer, in which the answerer associates the answerer BUNDLE
      address with each bundled "m=" line (including the newly added
      "m=" line) within the BUNDLE group.


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar zen
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10000 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 20000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtpmap:66 H261/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE foo bar zen
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000



Holmberg, et al.        Expires December 21, 2016              [Page 36]

Internet-Draft                Bundled media                    June 2016


       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 20000 RTP/AVP 32
       b=AS:1000
       a=mid:bar
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 20000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtpmap:66 H261/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid



17.4.  Example: Offerer Moves A Media Description Out Of A BUNDLE Group

   The example below shows:

   o  A subsequent offer (the BUNDLE group has been created as part of a
      previous offer/answer transaction), in which the offerer moves a
      bundled "m=" line out of a BUNDLE group, associates a unique
      address with the moved "m=" line, and associates the offerer
      BUNDLE address with each other bundled "m=" line within the BUNDLE
      group.

   o  An answer, in which the answerer moves the "m=" line out of the
      BUNDLE group, associates unique address with the moved "m=" line,
      and associates the answerer BUNDLE address with each of the
      remaining bundled "m=" line within the BUNDLE group.


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10000 RTP/AVP 31 32
       b=AS:1000



Holmberg, et al.        Expires December 21, 2016              [Page 37]

Internet-Draft                Bundled media                    June 2016


       a=mid:bar
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 50000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtpmap:66 H261/90000


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 20000 RTP/AVP 32
       b=AS:1000
       a=mid:bar
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 60000 RTP/AVP 66
       b=AS:1000
       a=mid:zen
       a=rtpmap:66 H261/90000



17.5.  Example: Offerer Disables A Media Description Within A BUNDLE
       Group

   The example below shows:

   o  A subsequent offer (the BUNDLE group has been created as part of a
      previous offer/answer transaction), in which the offerer disables
      a bundled "m=" line within BUNDLE group, assigns a zero port
      number to the disabled "m=" line, and associates the offerer
      BUNDLE address with each of the other bundled "m=" lines within
      the BUNDLE group.





Holmberg, et al.        Expires December 21, 2016              [Page 38]

Internet-Draft                Bundled media                    June 2016


   o  An answer, in which the answerer moves the disabled "m=" line out
      of the BUNDLE group, assigns a zero port value to the disabled
      "m=" line, and associates the answerer BUNDLE address with each of
      the remaining bundled "m=" line within the BUNDLE group.


   SDP Offer (1)

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 10000 RTP/AVP 0 8 97
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=rtpmap:8 PCMA/8000
       a=rtpmap:97 iLBC/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 10000 RTP/AVP 31 32
       b=AS:1000
       a=mid:bar
       a=rtpmap:31 H261/90000
       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 66
       a=mid:zen
       a=rtpmap:66 H261/90000


   SDP Answer (2)

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       a=group:BUNDLE foo bar
       m=audio 20000 RTP/AVP 0
       b=AS:200
       a=mid:foo
       a=rtpmap:0 PCMU/8000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 20000 RTP/AVP 32
       b=AS:1000
       a=mid:bar



Holmberg, et al.        Expires December 21, 2016              [Page 39]

Internet-Draft                Bundled media                    June 2016


       a=rtpmap:32 MPV/90000
       a=extmap 1 urn:ietf:params:rtp-hdrext:sdes:mid
       m=video 0 RTP/AVP 66
       a=mid:zen
       a=rtpmap:66 H261/90000



18.  Acknowledgements

   The usage of the SDP grouping extension for negotiating bundled media
   is based on a similar alternatives proposed by Harald Alvestrand and
   Cullen Jennings.  The BUNDLE extension described in this document is
   based on the different alternative proposals, and text (e.g.  SDP
   examples) have been borrowed (and, in some cases, modified) from
   those alternative proposals.

   The SDP examples are also modified versions from the ones in the
   Alvestrand proposal.

   Thanks to Paul Kyzivat, Martin Thomson, Flemming Andreasen, Thomas
   Stach, Ari Keranen, Adam Roach, Christian Groves, Roman Shpount,
   Suhas Nandakumar, Nils Ohlmeier, Jens Guballa, Raju Makaraju and
   Justin Uberti for reading the text, and providing useful feedback.

   Thanks to Magnus Westerlund, Colin Perkins and Jonathan Lennox for
   providing help and text on the RTP/RTCP procedures.

   Thanks to Spotify for providing music for the countless hours of
   document editing.

19.  Change Log

   [RFC EDITOR NOTE: Please remove this section when publishing]

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-30

   o  Indicating in the Abstract and Introduction that the document
      updates RFC 3264.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-29

   o  Change based on WGLC comment from Colin Perkins.

   o  - Clarify that SSRC can be reused by another source after a delay
      of 5 RTCP reporting intervals.

   o  Change based on WGLC comment from Alissa Cooper.



Holmberg, et al.        Expires December 21, 2016              [Page 40]

Internet-Draft                Bundled media                    June 2016


   o  - IANA registry name fix.

   o  - Additional IANA registration information added.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-28

   o  - Alignment with exclusive mux procedures.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-27

   o  - Yet another terminology change.

   o  - Mux category considerations added.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-26

   o  - ICE considerations modified: ICE-related SDP attributes only
      added to the bundled m- line representing the selected BUNDLE
      address.

   o  - Reference to draft-ietf-mmusic-ice-sip-sdp added.

   o  - Reference to RFC 5245 replaced with reference to draft-ietf-ice-
      rfc5245bis.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-25

   o  - RTP/RTCP mux procedures updated with exclusive RTP/RTCP mux
      considerations.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-24

   o  - Reference and procedures associated with exclusive RTP/RTCP mux
      added

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-23

   o  - RTCP-MUX mandatory for bundled RTP m- lines

   o  - Editorial fixes based on comments from Flemming Andreasen

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-22

   o  - Correction of Ari's family name

   o  - Editorial fixes based on comments from Thomas Stach

   o  - RTP/RTCP correction based on comment from Magnus Westerlund



Holmberg, et al.        Expires December 21, 2016              [Page 41]

Internet-Draft                Bundled media                    June 2016


   o  -- http://www.ietf.org/mail-archive/web/mmusic/current/
      msg14861.html

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-21

   o  - Correct based on comment from Paul Kyzivat

   o  -- 'received packets' replaced with 'received data'

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-20

   o  - Clarification based on comment from James Guballa

   o  - Clarification based on comment from Flemming Andreasen

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-19

   o  - DTLS Considerations section added.

   o  - BUNDLE semantics added to the IANA Considerations

   o  - Changes based on WGLC comments from Adam Roach

   o  -- http://www.ietf.org/mail-archive/web/mmusic/current/
      msg14673.html

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-18

   o  - Changes based on agreements at IETF#92

   o  -- BAS Offer removed, based on agreement at IETF#92.

   o  -- Procedures regarding usage of SDP "b=" line is replaced with a
      reference to to draft-ietf-mmusic-sdp-mux-attributes.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-17

   o  - Editorial changes based on comments from Magnus Westerlund.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-16

   o  - Modification of RTP/RTCP multiplexing section, based on comments
      from Magnus Westerlund.

   o  - Reference updates.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-15




Holmberg, et al.        Expires December 21, 2016              [Page 42]

Internet-Draft                Bundled media                    June 2016


   o  - Editorial fix.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-14

   o  - Editorial changes.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-13

   o  Changes to allow a new suggested offerer BUNDLE address to be
      assigned to each bundled m- line.

   o  Changes based on WGLC comments from Paul Kyzivat

   o  - Editorial fixes

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-12

   o  Usage of SDP 'extmap' attribute added

   o  SDP 'bundle-only' attribute scoped with "m=" lines with a zero
      port value

   o  Changes based on WGLC comments from Thomas Stach

   o  - ICE candidates not assigned to bundle-only m- lines with a zero
      port value

   o  - Editorial changes

   o  Changes based on WGLC comments from Colin Perkins

   o  - Editorial changes:

   o  -- "RTP SDES item" -> "RTCP SDES item"

   o  -- "RTP MID SDES item" -> "RTCP MID SDES item"

   o  - Changes in section 10.1.1:

   o  -- "SHOULD NOT" -> "MUST NOT"

   o  -- Additional text added to the Note

   o  - Change to section 13.2:

   o  -- Clarify that mid value is not zero terminated

   o  - Change to section 13.3:



Holmberg, et al.        Expires December 21, 2016              [Page 43]

Internet-Draft                Bundled media                    June 2016


   o  -- Clarify that mid value is not zero terminated

   o  -- Clarify padding

   o  Changes based on WGLC comments from Paul Kyzivat

   o  - Editorial changes:

   o  Changes based on WGLC comments from Jonathan Lennox

   o  - Editorial changes:

   o  - Defintion of SDP bundle-only attribute alligned with structure
      in 4566bis draft

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-11

   o  Editorial corrections based on comments from Harald Alvestrand.

   o  Editorial corrections based on comments from Cullen Jennings.

   o  Reference update (RFC 7160).

   o  Clarification about RTCP packet sending when RTP/RTCP multiplexing
      is not used (http://www.ietf.org/mail-archive/web/mmusic/current/
      msg13765.html).

   o  Additional text added to the Security Considerations.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-10

   o  SDP bundle-only attribute added to IANA Considerations.

   o  SDES item and RTP header extension added to Abstract and
      Introduction.

   o  Modification to text updating section 8.2 of RFC 3264.

   o  Reference corrections.

   o  Editorial corrections.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-09

   o  Terminology change: "bundle-only attribute assigned to m= line" to
      "bundle-only attribute associated with m= line".

   o  Editorial corrections.



Holmberg, et al.        Expires December 21, 2016              [Page 44]

Internet-Draft                Bundled media                    June 2016


   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-08

   o  Editorial corrections.

   o  - "of"->"if" (8.3.2.5).

   o  - "optional"->"OPTIONAL" (9.1).

   o  - Syntax/ABNF for 'bundle-only' attribute added.

   o  - SDP Offer/Answer sections merged.

   o  - 'Request new offerer BUNDLE address' section added

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-07

   o  OPEN ISSUE regarding Receiver-ID closed.

   o  - RTP MID SDES Item.

   o  - RTP MID Header Extension.

   o  OPEN ISSUE regarding insertion of SDP 'rtcp' attribute in answers
      closed.

   o  - Indicating that, when rtcp-mux is used, the answerer MUST NOT
      include an 'rtcp' attribute in the answer, based on the procedures
      in section 5.1.3 of RFC 5761.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-06

   o  Draft title changed.

   o  Added "SDP" to section names containing "Offer" or "Answer".

   o  Editorial fixes based on comments from Paul Kyzivat
      (http://www.ietf.org/mail-archive/web/mmusic/current/
      msg13314.html).

   o  Editorial fixed based on comments from Colin Perkins
      (http://www.ietf.org/mail-archive/web/mmusic/current/
      msg13318.html).

   o  - Removed text about extending BUNDLE to allow multiple RTP
      sessions within a BUNDLE group.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-05




Holmberg, et al.        Expires December 21, 2016              [Page 45]

Internet-Draft                Bundled media                    June 2016


   o  Major re-structure of SDP Offer/Answer sections, to align with RFC
      3264 structure.

   o  Additional definitions added.

   o  - Shared address.

   o  - Bundled "m=" line.

   o  - Bundle-only "m=" line.

   o  - Offerer suggested BUNDLE mid.

   o  - Answerer selected BUNDLE mid.

   o  Q6 Closed (IETF#88): An Offerer MUST NOT assign a shared address
      to multiple "m=" lines until it has received an SDP Answer
      indicating support of the BUNDLE extension.

   o  Q8 Closed (IETF#88): An Offerer can, before it knows whether the
      Answerer supports the BUNDLE extension, assign a zero port value
      to a 'bundle-only' "m=" line.

   o  SDP 'bundle-only' attribute section added.

   o  Connection data nettype/addrtype restrictions added.

   o  RFC 3264 update section added.

   o  Indicating that a specific payload type value can be used in
      multiple "m=" lines, if the value represents the same codec
      configuration in each "m=" line.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-04

   o  Updated Offerer procedures (http://www.ietf.org/mail-
      archive/web/mmusic/current/msg12293.html).

   o  Updated Answerer procedures (http://www.ietf.org/mail-
      archive/web/mmusic/current/msg12333.html).

   o  Usage of SDP 'bundle-only' attribute added.

   o  Reference to Trickle ICE document added.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-02





Holmberg, et al.        Expires December 21, 2016              [Page 46]

Internet-Draft                Bundled media                    June 2016


   o  Mechanism modified, to be based on usage of SDP Offers with both
      different and identical port number values, depending on whether
      it is known if the remote endpoint supports the extension.

   o  Cullen Jennings added as co-author.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-01

   o  No changes.  New version due to expiration.

   Changes from draft-ietf-mmusic-sdp-bundle-negotiation-00

   o  No changes.  New version due to expiration.

   Changes from draft-holmberg-mmusic-sdp-multiplex-negotiation-00

   o  Draft name changed.

   o  Harald Alvestrand added as co-author.

   o  "Multiplex" terminology changed to "bundle".

   o  Added text about single versus multiple RTP Sessions.

   o  Added reference to RFC 3550.

20.  References

20.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <http://www.rfc-editor.org/info/rfc2119>.

   [RFC3264]  Rosenberg, J. and H. Schulzrinne, "An Offer/Answer Model
              with Session Description Protocol (SDP)", RFC 3264,
              DOI 10.17487/RFC3264, June 2002,
              <http://www.rfc-editor.org/info/rfc3264>.

   [RFC3550]  Schulzrinne, H., Casner, S., Frederick, R., and V.
              Jacobson, "RTP: A Transport Protocol for Real-Time
              Applications", STD 64, RFC 3550, DOI 10.17487/RFC3550,
              July 2003, <http://www.rfc-editor.org/info/rfc3550>.







Holmberg, et al.        Expires December 21, 2016              [Page 47]

Internet-Draft                Bundled media                    June 2016


   [RFC3605]  Huitema, C., "Real Time Control Protocol (RTCP) attribute
              in Session Description Protocol (SDP)", RFC 3605,
              DOI 10.17487/RFC3605, October 2003,
              <http://www.rfc-editor.org/info/rfc3605>.

   [RFC4566]  Handley, M., Jacobson, V., and C. Perkins, "SDP: Session
              Description Protocol", RFC 4566, DOI 10.17487/RFC4566,
              July 2006, <http://www.rfc-editor.org/info/rfc4566>.

   [RFC4961]  Wing, D., "Symmetric RTP / RTP Control Protocol (RTCP)",
              BCP 131, RFC 4961, DOI 10.17487/RFC4961, July 2007,
              <http://www.rfc-editor.org/info/rfc4961>.

   [RFC5245]  Rosenberg, J., "Interactive Connectivity Establishment
              (ICE): A Protocol for Network Address Translator (NAT)
              Traversal for Offer/Answer Protocols", RFC 5245,
              DOI 10.17487/RFC5245, April 2010,
              <http://www.rfc-editor.org/info/rfc5245>.

   [RFC5285]  Singer, D. and H. Desineni, "A General Mechanism for RTP
              Header Extensions", RFC 5285, DOI 10.17487/RFC5285, July
              2008, <http://www.rfc-editor.org/info/rfc5285>.

   [RFC5761]  Perkins, C. and M. Westerlund, "Multiplexing RTP Data and
              Control Packets on a Single Port", RFC 5761,
              DOI 10.17487/RFC5761, April 2010,
              <http://www.rfc-editor.org/info/rfc5761>.

   [RFC5764]  McGrew, D. and E. Rescorla, "Datagram Transport Layer
              Security (DTLS) Extension to Establish Keys for the Secure
              Real-time Transport Protocol (SRTP)", RFC 5764,
              DOI 10.17487/RFC5764, May 2010,
              <http://www.rfc-editor.org/info/rfc5764>.

   [RFC5888]  Camarillo, G. and H. Schulzrinne, "The Session Description
              Protocol (SDP) Grouping Framework", RFC 5888,
              DOI 10.17487/RFC5888, June 2010,
              <http://www.rfc-editor.org/info/rfc5888>.

   [RFC6347]  Rescorla, E. and N. Modadugu, "Datagram Transport Layer
              Security Version 1.2", RFC 6347, DOI 10.17487/RFC6347,
              January 2012, <http://www.rfc-editor.org/info/rfc6347>.

   [I-D.ietf-ice-rfc5245bis]
              Keraenen, A., Holmberg, C., and J. Rosenberg, "Interactive
              Connectivity Establishment (ICE): A Protocol for Network
              Address Translator (NAT) Traversal", draft-ietf-ice-
              rfc5245bis-02 (work in progress), June 2016.



Holmberg, et al.        Expires December 21, 2016              [Page 48]

Internet-Draft                Bundled media                    June 2016


   [I-D.ietf-mmusic-sdp-mux-attributes]
              Nandakumar, S., "A Framework for SDP Attributes when
              Multiplexing", draft-ietf-mmusic-sdp-mux-attributes-12
              (work in progress), January 2016.

   [I-D.ietf-mmusic-mux-exclusive]
              Holmberg, C., "Indicating Exclusive Support of RTP/RTCP
              Multiplexing using SDP", draft-ietf-mmusic-mux-
              exclusive-07 (work in progress), June 2016.

   [I-D.ietf-mmusic-ice-sip-sdp]
              Petit-Huguenin, M., Keraenen, A., and S. Nandakumar,
              "Using Interactive Connectivity Establishment (ICE) with
              Session Description Protocol (SDP) offer/answer and
              Session Initiation Protocol (SIP)", draft-ietf-mmusic-ice-
              sip-sdp-08 (work in progress), March 2016.

20.2.  Informative References

   [RFC3261]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston,
              A., Peterson, J., Sparks, R., Handley, M., and E.
              Schooler, "SIP: Session Initiation Protocol", RFC 3261,
              DOI 10.17487/RFC3261, June 2002,
              <http://www.rfc-editor.org/info/rfc3261>.

   [RFC4568]  Andreasen, F., Baugher, M., and D. Wing, "Session
              Description Protocol (SDP) Security Descriptions for Media
              Streams", RFC 4568, DOI 10.17487/RFC4568, July 2006,
              <http://www.rfc-editor.org/info/rfc4568>.

   [RFC5576]  Lennox, J., Ott, J., and T. Schierl, "Source-Specific
              Media Attributes in the Session Description Protocol
              (SDP)", RFC 5576, DOI 10.17487/RFC5576, June 2009,
              <http://www.rfc-editor.org/info/rfc5576>.

   [RFC7160]  Petit-Huguenin, M. and G. Zorn, Ed., "Support for Multiple
              Clock Rates in an RTP Session", RFC 7160,
              DOI 10.17487/RFC7160, April 2014,
              <http://www.rfc-editor.org/info/rfc7160>.

   [I-D.ietf-mmusic-trickle-ice]
              Ivov, E., Rescorla, E., and J. Uberti, "Trickle ICE:
              Incremental Provisioning of Candidates for the Interactive
              Connectivity Establishment (ICE) Protocol", draft-ietf-
              mmusic-trickle-ice-02 (work in progress), January 2015.






Holmberg, et al.        Expires December 21, 2016              [Page 49]

Internet-Draft                Bundled media                    June 2016


Appendix A.  Design Considerations

A.1.  General

   One of the main issues regarding the BUNDLE grouping extensions has
   been whether, in SDP Offers and SDP Answers, the same port value
   should be inserted in "m=" lines associated with a BUNDLE group, as
   the purpose of the extension is to negotiate the usage of a single
   address:port combination for media specified by the "m=" lines.
   Issues with both approaches, discussed in the Appendix have been
   raised.  The outcome was to specify a mechanism which uses SDP Offers
   with both different and identical port values.

   Below are the primary issues that have been considered when defining
   the "BUNDLE" grouping extension:

   o  1) Interoperability with existing UAs.

   o  2) Interoperability with intermediary B2BUA- and proxy entities.

   o  3) Time to gather, and the number of, ICE candidates.

   o  4) Different error scenarios, and when they occur.

   o  5) SDP Offer/Answer impacts, including usage of port number value
      zero.

   NOTE: Before this document is published as an RFC, this
   Appendix might be removed.

A.2.  UA Interoperability

   Consider the following SDP Offer/Answer exchange, where Alice sends
   an SDP Offer to Bob:

















Holmberg, et al.        Expires December 21, 2016              [Page 50]

Internet-Draft                Bundled media                    June 2016


   SDP Offer

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       m=audio 10000 RTP/AVP 97
       a=rtpmap:97 iLBC/8000
       m=video 10002 RTP/AVP 97
       a=rtpmap:97 H261/90000




   SDP Answer

       v=0
       o=bob 2808844564 2808844564 IN IP4 biloxi.example.com
       s=
       c=IN IP4 biloxi.example.com
       t=0 0
       m=audio 20000 RTP/AVP 97
       a=rtpmap:97 iLBC/8000
       m=video 20002 RTP/AVP 97
       a=rtpmap:97 H261/90000


   RFC 4961 specifies a way of doing symmetric RTP but that is an a
   later invention to RTP and Bob can not assume that Alice supports RFC
   4961.  This means that Alice may be sending RTP from a different port
   than 10000 or 10002 - some implementation simply send the RTP from an
   ephemeral port.  When Bob's endpoint receives an RTP packet, the only
   way that Bob know if it should be passed to the video or audio codec
   is by looking at the port it was received on.  This lead some SDP
   implementations to use the fact that each "m=" line had a different
   port number to use that port number as an index to find the correct m
   line in the SDP.  As a result, some implementations that do support
   symmetric RTP and ICE still use a SDP data structure where SDP with
   "m=" lines with the same port such as:











Holmberg, et al.        Expires December 21, 2016              [Page 51]

Internet-Draft                Bundled media                    June 2016


   SDP Offer

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       m=audio 10000 RTP/AVP 97
       a=rtpmap:97 iLBC/8000
       m=video 10000 RTP/AVP 98
       a=rtpmap:98 H261/90000



   will result in the second "m=" line being considered an SDP error
   because it has the same port as the first line.

A.3.  Usage of port number value zero

   In an SDP Offer or SDP Answer, the media specified by an "m=" line
   can be disabled/rejected by setting the port number value to zero.
   This is different from e.g. using the SDP direction attributes, where
   RTCP traffic will continue even if the SDP "inactive" attribute is
   indicated for the associated "m=" line.

   If each "m=" line associated with a BUNDLE group would contain
   different port values, and one of those port values would be used for
   a BUNDLE address associated with the BUNDLE group, problems would
   occur if an endpoint wants to disable/reject the "m=" line associated
   with that port, by setting the port value to zero.  After that, no
   "m=" line would contain the port value which is used for the BUNDLE
   address.  In addition, it is unclear what would happen to the ICE
   candidates associated with the "m=" line, as they are also used for
   the BUNDLE address.

A.4.  B2BUA And Proxy Interoperability

   Some back to back user agents may be configured in a mode where if
   the incoming call leg contains an SDP attribute the B2BUA does not
   understand, the B2BUS still generates that SDP attribute in the Offer
   for the outgoing call leg.  Consider an B2BUA that did not understand
   the SDP "rtcp" attribute, defined in RFC 3605, yet acted this way.
   Further assume that the B2BUA was configured to tear down any call
   where it did not see any RTCP for 5 minutes.  In this cases, if the
   B2BUA received an Offer like:






Holmberg, et al.        Expires December 21, 2016              [Page 52]

Internet-Draft                Bundled media                    June 2016


   SDP Offer

       v=0
       o=alice 2890844526 2890844526 IN IP4 atlanta.example.com
       s=
       c=IN IP4 atlanta.example.com
       t=0 0
       m=audio 49170 RTP/AVP 0
       a=rtcp:53020



   It would be looking for RTCP on port 49172 but would not see any
   because the RTCP would be on port 53020 and after five minutes, it
   would tear down the call.  Similarly, an SBC that did not understand
   BUNDLE yet put BUNDLE in it's offer may be looking for media on the
   wrong port and tear down the call.  It is worth noting that a B2BUA
   that generated an Offer with capabilities it does not understand is
   not compliant with the specifications.

A.4.1.  Traffic Policing

   Sometimes intermediaries do not act as B2BUA, in the sense that they
   don't modify SDP bodies, nor do they terminate SIP dialogs.  Still,
   however, they may use SDP information (e.g.  IP address and port) in
   order to control traffic gating functions, and to set traffic
   policing rules.  There might be rules which will trigger a session to
   be terminated in case media is not sent or received on the ports
   retrieved from the SDP.  This typically occurs once the session is
   already established and ongoing.

A.4.2.  Bandwidth Allocation

   Sometimes intermediaries do not act as B2BUA, in the sense that they
   don't modify SDP bodies, nor do they terminate SIP dialogs.  Still,
   however, they may use SDP information (e.g. codecs and media types)
   in order to control bandwidth allocation functions.  The bandwidth
   allocation is done per "m=" line, which means that it might not be
   enough if media specified by all "m=" lines try to use that
   bandwidth.  That may either simply lead to bad user experience, or to
   termination of the call.

A.5.  Candidate Gathering

   When using ICE, an candidate needs to be gathered for each port.
   This takes approximately 20 ms extra for each extra "m=" line due to
   the NAT pacing requirements.  All of this gather can be overlapped
   with other things while the page is loading to minimize the impact.



Holmberg, et al.        Expires December 21, 2016              [Page 53]

Internet-Draft                Bundled media                    June 2016


   If the client only wants to generate TURN or STUN ICE candidates for
   one of the "m=" lines and then use trickle ICE
   [I-D.ietf-mmusic-trickle-ice] to get the non host ICE candidates for
   the rest of the "m=" lines, it MAY do that and will not need any
   additional gathering time.

   Some people have suggested a TURN extension to get a bunch of TURN
   allocation at once.  This would only provide a single STUN result so
   in cases where the other end did not support BUNDLE, may cause more
   use of the TURN server but would be quick in the cases where both
   sides supported BUNDLE and would fall back to a successful call in
   the other cases.

Authors' Addresses

   Christer Holmberg
   Ericsson
   Hirsalantie 11
   Jorvas  02420
   Finland

   Email: christer.holmberg@ericsson.com


   Harald Tveit Alvestrand
   Google
   Kungsbron 2
   Stockholm  11122
   Sweden

   Email: harald@alvestrand.no


   Cullen Jennings
   Cisco
   400 3rd Avenue SW, Suite 350
   Calgary, AB  T2P 4H2
   Canada

   Email: fluffy@iii.ca











Holmberg, et al.        Expires December 21, 2016              [Page 54]
